Revit 2027 API
ExternalServices.BuiltInExternalServices.IFCImporterService Property
 The external service which permits registration of an alternate implementation for IFC import.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId IFCImporterService { get; }
Public Shared ReadOnly Property IFCImporterService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ IFCImporterService {
	ExternalServiceId^ get ();
}
static member IFCImporterService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace